name: "c3d_lstm"

#---------clip-markers----------------
layer {
  name: "clip_data"
  type: "ImageData"
  top: "dummy"
  top: "clip"

  image_data_param {
    source: "/home/paritosh/Folder/vc2/examples/gym_vault_c3d_lstm/gym_vault_c3d_lstm_clipmarkers.txt"
    batch_size: 30
    shuffle: false
  }
}

layer {
  name: "Silence"
  type: "Silence"
  bottom: "dummy"
}
#---------------------filter mask----------------------
layer {
  name: "clip_data"
  type: "ImageData"
  top: "dummy3"
  top: "filter_mask"

  image_data_param {
    source: "/home/paritosh/Folder/vc2/examples/gym_vault_c3d_lstm/gym_vault_c3d_lstm_clipmarkers.txt"
    batch_size: 30
    shuffle: false
  }
}

layer {
  name: "Silence"
  type: "Silence"
  bottom: "dummy3"
}
#-----------------scores--------------------
layer {
  name: "score_data"
  type: "ImageData"
  top: "dummy1"
  top: "score"

  image_data_param {
    source: "/home/paritosh/Folder/vc2/examples/gym_vault_c3d_lstm/split_4/c3d_lstm_train_scores_final.txt"
    batch_size: 30
    shuffle: false
  }
  include {
    phase: TRAIN
  }
}
layer {
  name: "score_data"
  type: "ImageData"
  top: "dummy1"
  top: "score"

  image_data_param {
    source: "/home/paritosh/Folder/vc2/examples/gym_vault_c3d_lstm/split_4/c3d_lstm_test_scores_incre.txt"
    batch_size: 30
    shuffle: false
  }
  include {
    phase: TEST
  }
}
layer{
  name: "Score_scaler"
  type: "Power"
  bottom: "score"
  top: "score"
  power_param {
    power: 1
    scale: 0.01
    shift: 0
  }
}
layer {
  name: "Silence1"
  type: "Silence"
  bottom: "dummy1"
}

#-----------------difficulty--------------------
layer {
  name: "diff_data"
  type: "ImageData"
  top: "dummy2"
  top: "difficulty"

  image_data_param {
    source: "/home/paritosh/Folder/vc2/examples/gym_vault_c3d_lstm/split_4/c3d_lstm_train_diff_final.txt"
    batch_size: 30
    shuffle: false
  }
  include {
    phase: TRAIN
  }
}
layer {
  name: "diff_data"
  type: "ImageData"
  top: "dummy2"
  top: "difficulty"

  image_data_param {
    source: "/home/paritosh/Folder/vc2/examples/gym_vault_c3d_lstm/split_4/c3d_lstm_test_diff_incre.txt"
    batch_size: 30
    shuffle: false
  }
  include {
    phase: TEST
  }
}
layer{
  name: "Difficulty_scaler"
  type: "Power"
  bottom: "difficulty"
  top: "difficulty"
  power_param {
    power: 1
    scale: 0.01
    shift: 0
  }
}
layer {
  name: "Silence2"
  type: "Silence"
  bottom: "dummy2"
}

#-------------------------final_score---------------------
layer {
  name: "final_score"
  type: "Eltwise"
  bottom: "score"
  bottom: "difficulty"
  top: "final_score"
  eltwise_param { operation: SUM }
}

# ----- video/label input -----
# ----- for training
layer {
  name: "data"
  type: "VideoData"
  top: "data"
  top: "label"
  video_data_param {
    source: "/home/paritosh/Folder/vc2/examples/gym_vault_c3d_lstm/split_4/c3d_lstm_train_input.txt"
    batch_size: 30
    new_height: 128
    new_width: 171
    new_length: 16
    shuffle: false
  }
  include {
    phase: TRAIN
  }
  transform_param {
    crop_size: 112
    mirror: true
     mean_file: "/home/paritosh/Folder/vc2/examples/c3d_ucf101/ucf101_train_mean.binaryproto"
    #mean_value: 90
    #mean_value: 98
    #mean_value: 102
  }
}
layer {
  name: "data"
  type: "VideoData"
  top: "data"
  top: "label"
  video_data_param {
    source: "/home/paritosh/Folder/vc2/examples/gym_vault_c3d_lstm/split_4/c3d_lstm_test_input.txt"
    batch_size: 30
    new_height: 128
    new_width: 171
    new_length: 16
    shuffle: false
  }
  include {
    phase: TEST
  }
  transform_param {
    crop_size: 112
    mirror: false
     mean_file: "/home/paritosh/Folder/vc2/examples/c3d_ucf101/ucf101_train_mean.binaryproto"
    #mean_value: 90
    #mean_value: 98
    #mean_value: 102
  }
}
layer {
  name: "Silence3"
  type: "Silence"
  bottom: "label"
}

# ----- 1st group -----
layer {
  name: "conv1a"
  type: "NdConvolution"
  bottom: "data"
  top: "conv1a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_shape { dim: 3 dim: 3 dim: 3 }
    stride_shape { dim: 1 dim: 1 dim: 1 }
    pad_shape    { dim: 1 dim: 1 dim: 1 }
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1a"
  type: "ReLU"
  bottom: "conv1a"
  top: "conv1a"
}
layer {
  name: "pool1"
  type: "NdPooling"
  bottom: "conv1a"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_shape { dim: 1 dim: 2 dim: 2 }
    stride_shape { dim: 1 dim: 2 dim: 2 }
  }
}

# ----- 2nd group -----
layer {
  name: "conv2a"
  type: "NdConvolution"
  bottom: "pool1"
  top: "conv2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_shape { dim: 3 dim: 3 dim: 3 }
    stride_shape { dim: 1 dim: 1 dim: 1 }
    pad_shape    { dim: 1 dim: 1 dim: 1 }
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu2a"
  type: "ReLU"
  bottom: "conv2a"
  top: "conv2a"
}
layer {
  name: "pool2"
  type: "NdPooling"
  bottom: "conv2a"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_shape { dim: 2 dim: 2 dim: 2 }
    stride_shape { dim: 2 dim: 2 dim: 2 }
  }
}

# ----- 3rd group -----
layer {
  name: "conv3a"
  type: "NdConvolution"
  bottom: "pool2"
  top: "conv3a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_shape { dim: 3 dim: 3 dim: 3 }
    stride_shape { dim: 1 dim: 1 dim: 1 }
    pad_shape    { dim: 1 dim: 1 dim: 1 }
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu3a"
  type: "ReLU"
  bottom: "conv3a"
  top: "conv3a"
}
layer {
  name: "pool3"
  type: "NdPooling"
  bottom: "conv3a"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_shape { dim: 2 dim: 2 dim: 2 }
    stride_shape { dim: 2 dim: 2 dim: 2 }
  }
}

# ----- 4th group -----
layer {
  name: "conv4a"
  type: "NdConvolution"
  bottom: "pool3"
  top: "conv4a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_shape { dim: 3 dim: 3 dim: 3 }
    stride_shape { dim: 1 dim: 1 dim: 1 }
    pad_shape    { dim: 1 dim: 1 dim: 1 }
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu4a"
  type: "ReLU"
  bottom: "conv4a"
  top: "conv4a"
}
layer {
  name: "pool4"
  type: "NdPooling"
  bottom: "conv4a"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_shape { dim: 2 dim: 2 dim: 2 }
    stride_shape { dim: 2 dim: 2 dim: 2 }
  }
}

# ----- 5th group -----
layer {
  name: "conv5a"
  type: "NdConvolution"
  bottom: "pool4"
  top: "conv5a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_shape { dim: 3 dim: 3 dim: 3 }
    stride_shape { dim: 1 dim: 1 dim: 1 }
    pad_shape    { dim: 1 dim: 1 dim: 1 }
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu5a"
  type: "ReLU"
  bottom: "conv5a"
  top: "conv5a"
}
layer {
  name: "pool5"
  type: "NdPooling"
  bottom: "conv5a"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_shape { dim: 2 dim: 2 dim: 2 }
    stride_shape { dim: 2 dim: 2 dim: 2 }
  }
}

# ----- 1st fc group -----
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}

#-------------LSTM layer score-----------------
layer {
  name: "lstm1"
  type: "Lstm"
  bottom: "fc6"
  bottom: "clip"
  top: "lstm1"

  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }

  lstm_param {
    num_output: 256
    clipping_threshold: 0.1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}

# ----- 2nd fc score group -----
layer {
  name: "fc7-1"
  type: "InnerProduct"
  bottom: "lstm1"
  top: "fc7-1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.005
      #type: "xavier"
      #variance_norm: AVERAGE
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "filter1"
  type: "Filter"
  bottom: "fc7-1"
  bottom: "filter_mask"
  top: "filtered_fc7-1"
}
layer {
  name: "filter1_1"
  type: "Filter"
  bottom: "final_score"
  bottom: "filter_mask"
  top: "filtered_score"
}

layer {
  name: "loss1"
  type: "EuclideanLoss"
  bottom: "filtered_fc7-1"
  bottom: "filtered_score"
  top: "loss1"
  loss_weight: 1
}

